import pandas as pd

# 加载销售数据
hsr_df = pd.read_csv('data/K5.交易流水明细表2026-01-13_9_49_12_xian.csv', encoding='utf-8', parse_dates=['日期', '交易时间'],
                     dtype={"商品编码": str, "门店编码": str, "流水单号": str, "会员id": str})
hsr_df = hsr_df[(hsr_df['销售数量'] > 0) & (hsr_df['渠道名称'] == '线上销售')]
print("交易记录数：", len(hsr_df))
result = hsr_df.groupby(['门店编码', '商品编码']).size().reset_index(name='出现次数')
result = result.sort_values('出现次数', ascending=False)
# 获取总体前10名（不考虑门店）
top_10_overall = hsr_df['商品编码'].value_counts().head(50)
print("方法1 - 总体前10个商品编码（不考虑门店）:")
print(top_10_overall)
# 进口蓝莓（盒）125克/盒
# 润家蓝莓125g

'''
商品编码
2923759    18956
2250853    18942
5276318    12608
4361293     2867
5205742     2749
5277342     2474
910656      1485
5276707     1466
5277346     1461
5067582     1170
5276315     1056
4587201     1050
4006165     1002
5209745      908
5276403      761
1728771      750
1027167      679
4723215      603
806862       574
5276767      528
3096566      490
5276729      463
5276761      433
5276739      425
5277343      410
5246499      400
5276511      365
4746013      364
5276679      355
5277514      354
5241341      333
546998       330
5065855      323
5276509      320
5276553      312
5277480      307
8005381      280
5146802      280
5276501      276
5276669      275
4702168      269
4457288      266
5276725      265
5277344      264
2517201      262
8005833      258
5276605      257
5276779      251
5276525      248
5277579      238
'''